export const CONDITION_INFOMATION = {
  [27]: {
    name: '푸시업',
    conditions: ['척추의 중립', '이완시 팔꿈치 90도', '가슴의 충분한 이동', '손의 위치 가슴 중앙 여부', '고개 젖힘/숙임 여부']
  },
  [28]: {
    name: '니푸시업',
    conditions: ['척추의 중립', '이완시 팔꿈치 90도', '가슴의 충분한 이동', '손의 위치 가슴 중앙 여부', '고개 젖힘/숙임 여부']
  },
  [8]: {
    name: '굿모닝',
    conditions: ['척추의 중립', '무릎 구부린채 고정', '시선 방향 유지']
  },
  [29]: {
    name: 'Y-Exercise',
    conditions: ['양 팔 높이 동일', '엄지손가락 하늘방향', '경추 중립 또는 후인 유지']
  },
  [1]: {
    name: '스탠딩 사이드 크런치',
    conditions: ['척추의 중립', '시선 정면 유지', '수축시 무릎과 팔꿈치가 충분히 가까움', '무릎이 몸통 측면에서 올라오는지 여부', '양손이 머리 뒤에 위치']
  },
  [2]: {
    name: '스탠딩 니업',
    conditions: ['척추의 중립', '시선 정면 유지', '무릎 충분히 올라오고', '이완시 다리 긴장 유지']
  },
  [21]: {
    name: '라잉 레그 레이즈',
    conditions: ['허리 지면 고정', '허벅지와 종아리 각도 고정', '이완시 다리 긴장 유지', '고개 숙임 여부']
  },
  [22]: {
    name: '크런치',
    conditions: ['허리 지면 고정', '견갑골이 충분히 올라옴', '상체 반동 없음', '이완시 긴장 유지']
  },
  [23]: {
    name: '바이시클 크런치',
    conditions: ['허리 지면 고정', '수축시 무릎 엉덩이 지남', '견갑골이 충분히 올라옴']
  },
  [24]: {
    name: '시저크로스',
    conditions: ['허리 지면 고정', '수축시 양무릎 교차', '상체 고정', '다리와 지면사이 적당한 거리', '무릎 너무 굽히지 않음']
  },
  [26]: {
    name: '플랭크',
    conditions: ['팔꿈치가 어깨보다 안쪽에 위치하지 않음', '몸통과 엉덩이의 정렬 유지', '상체의 충분한 거리 유지']
  },
  [3]: {
    name: '버피 테스트',
    conditions: ['팔 펴고 엎드렸을 때 허리 휨 없음', '이완시 팔꿈치 90도', '가슴의 충분한 이동', '손의 위치 가슴 중앙 여부', '고개 젖힘/숙임 여부']
  },
  [4]: {
    name: '스텝 포워드 다이나믹 런지',
    conditions: ['앞 다리 무릎 각도 90도', '몸통 발 무릎 방향 일치 여부', '뒤다리 무릎 각도 90도', '척추의 중립', '상체의 과도한 숙임/젖힘 여부']
  },
  [5]: {
    name: '스텝 백워드 다이나믹 런지',
    conditions: ['앞 다리 무릎 각도 90도', '몸통 발 무릎 방향 일치 여부', '뒤다리 무릎 각도 90도', '척추의 중립', '상체의 과도한 숙임/젖힘 여부']
  },
  [6]: {
    name: '사이드 런지',
    conditions: ['앞 다리 무릎 각도 90도', '몸통 발 무릎 방향 일치 여부', '뒤다리 무릎 각도 90도', '척추의 중립', '상체의 과도한 숙임/젖힘 여부']
  },
  [7]: {
    name: '크로스 런지',
    conditions: ['앞 다리 무릎 각도 90도', '몸통 발 무릎 방향 일치 여부', '상체 정면 균형 잡기']
  },
  [25]: {
    name: '힙쓰러스트',
    conditions: ['수축시 무릎부터 어깨까지 일자', '이완시 긴장 유지', '고개 들지 않기']
  },
}